cask_args appdir: '/Applications'

tap 'cloudfoundry/tap'
tap 'graalvm/tap'
tap 'rusty-ferris-club/tap'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap "homebrew/cask-drivers"
tap "homebrew/services"

brew "ansible"
brew "ansible-lint"
brew "azure-cli"
brew "btop"
brew "coreutils"
brew "deno"
brew "fzf"
brew "fontconfig"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "go"
brew "gradle"
brew "gradle-completion"
brew "grep"
brew "htop"
brew "hyperfine"
brew "httpie"
brew "jenv"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "maven"
brew "minikube"
brew "neofetch"
brew "nvm"
brew "openssl"
brew "osx-cpu-temp"
brew "pipenv"
brew "poetry"
brew "python"
brew "shellcheck"
brew "step"
brew "tanka"
brew "tcptraceroute"
brew "terraform"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yadm"
brew "yarn"
brew "yq"

brew "cloudfoundry/tap/cf-cli"
brew "cloudfoundry/tap/cf-cli@7"
brew "cloudfoundry/tap/cf-cli@8"

cask "adobe-acrobat-reader"
cask "aerial"
cask "dbvisualizer"
cask "discord"
# cask "docker"
cask "firefox"
cask "fly"
cask "flycut"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "jd-gui"
cask "jdk-mission-control"
cask "jetbrains-toolbox"
cask "miro"
cask "microsoft-office"
cask "obs"
cask "postman"
cask "rectangle"
cask "skitch"
cask "slack"
cask "spotify"
cask "temurin"
cask "temurin11"
cask "temurin17"
cask "temurin8"
cask "visual-studio-code"
cask "visualvm"

cask "jetbrains-toolbox"

cask "mike-engel/jwt-cli/jwt-cli"