cask_args appdir: '/Applications'

tap 'adoptopenjdk/openjdk'
tap 'cloudfoundry/tap'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"


brew "openssl@1.1"
brew "xz"
brew "python"
brew "cassandra"
brew "coreutils"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "go"
brew "gradle"
brew "htop"
brew "hugo"
brew "jenv"
brew "jq"
brew "maven"
brew "neofetch"
brew "netcat"
brew "nmap"
brew "nvm"
brew "sbt"
brew "scala@2.11"
brew "tcptraceroute"
brew "vault"
brew "watch"
brew "wget"
brew "yadm"
brew "yarn"
brew "cloudfoundry/tap/cf-cli"

cask "adobe-acrobat-reader"
cask "adoptopenjdk8"
cask "adoptopenjdk11"
cask "adoptopenjdk12"
cask "adoptopenjdk13"
cask "aerial"
cask "atom"
cask "datagrip"
cask "dbvisualizer"
cask "discord"
cask "docker"
cask "firefox"
cask "fly"
cask "flycut"
cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-earth-pro"
cask "intellij-idea"
cask "iterm2"
cask "keepassxc"
cask "logitech-control-center"
cask "logitech-options"
cask "miro-formerly-realtimeboard"
cask "onedrive"
cask "postman"
cask "rubymine"
cask "shiftit"
cask "skitch"
cask "slack"
cask "visual-studio-code"
cask "visualvm"
cask "webex-meetings"
cask "webex-teams"
cask "webstorm"
